{
    "id": "1007A",
    "contest_id": 1007,
    "problem_letter": "A",
    "title": "A. Reorder the Array",
    "statement": "You are given an array of integers. Vasya can permute (change order) its integers. He wants to do it so that as many as possible integers will become on a place where a smaller integer used to stand. Help Vasya find the maximal number of such integers.\nFor instance, if we are given an array [10, 20, 30, 40], we can permute it so that it becomes [20, 40, 10, 30]. Then on the first and the second positions the integers became larger (20>10, 40>20) and did not on the third and the fourth, so for this permutation, the number that Vasya wants to maximize equals 2. Read the note for the first example, there is one more demonstrative test case.\nHelp Vasya to permute integers in such way that the number of positions in a new array, where integers are greater than in the original one, is maximal.\nThe first line contains a single integer n (1  n  10^5) — the length of the array.\nThe second line contains n integers a_1, a_2, , a_n (1  a_i  10^9) — the elements of the array.\nPrint a single integer — the maximal number of the array's elements which after a permutation will stand on the position where a smaller element stood in the initial array.\nIn the first sample, one of the best permutations is [1, 5, 5, 3, 10, 1, 1]. On the positions from second to fifth the elements became larger, so the answer for this permutation is 4.\nIn the second sample, there is no way to increase any element with a permutation, so the answer is 0.",
    "input": "The first line contains a single integer n (1 ≤q n ≤q 10^5) — the length of the array.",
    "output": "Print a single integer — the maximal number of the array's elements which after a permutation will stand on the position where a smaller element stood in the initial array.",
    "time_limit": "2 seconds",
    "memory_limit": "256 megabytes",
    "tags": [
        "combinatorics",
        "data structures",
        "math",
        "sortings",
        "two pointers",
        "*1300"
    ]
}