{
    "id": "1010F",
    "contest_id": 1010,
    "problem_letter": "F",
    "title": "F. Tree",
    "statement": "The Main Martian Tree grows on Mars. It is a binary tree (a rooted tree, with no more than two sons at each vertex) with n vertices, where the root vertex has the number 1. Its fruits are the Main Martian Fruits. It's summer now, so this tree does not have any fruit yet.\nAutumn is coming soon, and leaves and branches will begin to fall off the tree. It is clear, that if a vertex falls off the tree, then its entire subtree will fall off too. In addition, the root will remain on the tree. Formally: the tree will have some connected subset of vertices containing the root.\nAfter that, the fruits will grow on the tree (only at those vertices which remain). Exactly x fruits will grow in the root. The number of fruits in each remaining vertex will be not less than the sum of the numbers of fruits in the remaining sons of this vertex. It is allowed, that some vertices will not have any fruits.\nNatasha wondered how many tree configurations can be after the described changes. Since this number can be very large, output it modulo 998244353.\nTwo configurations of the resulting tree are considered different if one of these two conditions is true:\nThe first line contains two integers: n and x (1  n  10^5, 0  x  10^{18}) — the size of the tree and the number of fruits in the root.\nThe i-th of the following (n-1) lines contains two integers a_i and b_i (1  a_i, b_i  n) — vertices connected by the i-th edge of the tree.\nIt is guaranteed that the input data describes a correct binary tree with the root at the vertex 1.\nPrint one number — the number of configurations of the resulting tree modulo 998244353.\nConsider the first example. \nThere are 2 fruits at the vertex 1. The following 13 options are possible:\nConsider the second example. There are 5 fruits at the vertex 1. The following 7 options are possible:",
    "input": "The first line contains two integers: n and x (1 ≤ n ≤ 10^5, 0 ≤ x ≤ 10^{18}) — the size of the tree and the number of fruits in the root.",
    "output": "Print one number — the number of configurations of the resulting tree modulo $$$998244353$$$.",
    "time_limit": "7 seconds",
    "memory_limit": "256 megabytes",
    "tags": [
        "fft",
        "graphs",
        "trees",
        "*3400"
    ]
}