{
    "id": "1017C",
    "contest_id": 1017,
    "problem_letter": "C",
    "title": "C. The Phone Number",
    "statement": "Mrs. Smith is trying to contact her husband, John Smith, but she forgot the secret phone number!\nThe only thing Mrs. Smith remembered was that any permutation of n can be a secret phone number. Only those permutations that minimize secret value might be the phone of her husband.\nThe sequence of n integers is called a permutation if it contains all integers from 1 to n exactly once.\nThe secret value of a phone number is defined as the sum of the length of the longest increasing subsequence (LIS) and length of the longest decreasing subsequence (LDS). \nA subsequence a_{i_1}, a_{i_2}, , a_{i_k} where 1 i_1 < i_2 <  < i_k n is called increasing if a_{i_1} < a_{i_2} < a_{i_3} <  < a_{i_k}. If a_{i_1} > a_{i_2} > a_{i_3} >  > a_{i_k}, a subsequence is called decreasing. An increasing/decreasing subsequence is called longest if it has maximum length among all increasing/decreasing subsequences.\nFor example, if there is a permutation [6, 4, 1, 7, 2, 3, 5], LIS of this permutation will be [1, 2, 3, 5], so the length of LIS is equal to 4. LDS can be [6, 4, 1], [6, 4, 2], or [6, 4, 3], so the length of LDS is 3.\nNote, the lengths of LIS and LDS can be different.\nSo please help Mrs. Smith to find a permutation that gives a minimum sum of lengths of LIS and LDS.\nThe only line contains one integer n (1  n  10^5) — the length of permutation that you need to build.\nPrint a permutation that gives a minimum sum of lengths of LIS and LDS. \nIf there are multiple answers, print any.\nIn the first sample, you can build a permutation [3, 4, 1, 2]. LIS is [3, 4] (or [1, 2]), so the length of LIS is equal to 2. LDS can be ony of [3, 1], [4, 2], [3, 2], or [4, 1]. The length of LDS is also equal to 2. The sum is equal to 4. Note that [3, 4, 1, 2] is not the only permutation that is valid.\nIn the second sample, you can build a permutation [2, 1]. LIS is [1] (or [2]), so the length of LIS is equal to 1. LDS is [2, 1], so the length of LDS is equal to 2. The sum is equal to 3. Note that permutation [1, 2] is also valid.",
    "input": "The only line contains one integer n (1 ≤ n ≤ 10^5) — the length of permutation that you need to build.",
    "output": "Print a permutation that gives a minimum sum of lengths of LIS and LDS. ",
    "time_limit": "1 second",
    "memory_limit": "256 megabytes",
    "tags": [
        "constructive algorithms",
        "greedy",
        "*1600"
    ]
}