{
    "id": "1017H",
    "contest_id": 1017,
    "problem_letter": "H",
    "title": "H. The Films",
    "statement": "In \"The Man in the High Castle\" world, there are m different film endings. \nAbendsen owns a storage and a shelf. At first, he has n ordered films on the shelf. In the i-th month he will do:\nAnswer all Abendsen's questions.\nLet the probability be fraction P_i. Let's say that the total number of ways to take n films from the storage for i-th month is A_i, so P_i  A_i is always an integer. Print for each month P_i  A_i  {998244353}.\n998244353 is a prime number and it is equal to 119  2^{23} + 1.\nIt is guaranteed that there will be only no more than 100 different k values.\nThe first line contains three integers n, m, and q (1  n, m, q  10^5, n+q 10^5) — the number of films on the shelf initially, the number of endings, and the number of months.\nThe second line contains n integers e_1, e_2, , e_n (1 e_i m) — the ending of the i-th film on the shelf.\nEach of the next q lines contains three integers l_i, r_i, and k_i (1  l_i  r_i  n, 0  k_i  10^5) — the i-th query.\nIt is guaranteed that there will be only no more than 100 different k values.\nPrint the answer for each question in a separate line.\nIn the first sample in the second query, after adding 2  m films into the storage, the storage will look like this: \\{1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 4, 4\\}.\nThere are 26730 total ways of choosing the films so that e_l, e_{l+1}, , e_r will not be changed, for example, [1, 2, 3, 2, 2] and [1, 2, 3, 4, 3] are such ways.\nThere are 2162160 total ways of choosing the films, so you're asked to print ({26730}{2162160}  2162160)  998244353 = 26730.",
    "input": "The first line contains three integers n, m, and q (1 ≤ n, m, q ≤ 10^5, n+q≤q 10^5) — the number of films on the shelf initially, the number of endings, and the number of months.",
    "output": "Print the answer for each question in a separate line.",
    "time_limit": "5 seconds",
    "memory_limit": "512 megabytes",
    "tags": [
        "brute force",
        "*3300"
    ]
}